tutorials/microRichardsFoam/forcedFlow1D/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);
boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
